{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features including cyberpunk card styling, logo relocation, poster design adaptation, text visibility fixes, and Swiggy booking URL updates.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend components describing the MONKEYWORX COLLECTIVE website structure, including navigation, hero section, Holi Grail card, team dossier, ticketing, corporate events, and styling.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, borders, and component colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'MONKEYWORX COLLECTIVE', and script loading main.tsx module.",
  "frontend/src/App.tsx": "Root React component rendering the full page layout with Navigation, HeroSection, HoliGrailCard, TeamSection, TicketingSection, CorporateEventsSection, and Footer components in a dark-themed container.",
  "frontend/src/components/CorporateEventsSection.tsx": "Corporate events section displaying four service types (concerts, weddings, corporate parties, private events), bulk discount information, and contact CTA with phone number +91 63633 53339.",
  "frontend/src/components/Footer.tsx": "Site footer with MONKEYWORX branding, quick navigation links, social media icons (Facebook, Instagram @monkeyworxcollective, X), contact phone number, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/GlitchButton.tsx": "Reusable button component with cyberpunk styling featuring neon green background, hover transition to hot pink with glow effect, and glitch animation.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with placeholder image background, MONKEYWORX COLLECTIVE title with glitch effects and drop shadows for visibility, tagline, and SwiggyBookingCTA button.",
  "frontend/src/components/HoliGrailCard.tsx": "Cyberpunk-styled card component featuring Holi Grail event poster with animated neon glow border, event description, and integrated Swiggy booking CTA button.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar component with scroll-based styling, mobile menu toggle, and smooth scrolling to page sections (home, team, tickets, corporate).",
  "frontend/src/components/SwiggyBookingCTA.tsx": "Call-to-action button component that opens Swiggy Scenes booking link in a new window using the GlitchButton component.",
  "frontend/src/components/TeamSection.tsx": "Displays a grid of four team member cards with portraits, names, roles, and ID badges in a cyberpunk-styled dossier format.",
  "frontend/src/components/TicketingSection.tsx": "Renders five ticket tier options with pricing, features, and styling variations (neonGreen/hotPink borders) for the Holi Grail event.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an authenticated or anonymous backend actor based on Internet Identity state, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data operations are needed as all content is static and client-side rendered.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom cyberpunk color variables (neon-green, hot-pink, matte-black) and keyframe animations for glitch effects, scanlines, and image distortions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a cyberpunk design system with OKLCH color variables (neon green, hot pink, matte black), custom fonts (Bebas Neue, monospace), container settings, and animation keyframes for accordions.",
  "project_state.json": "Project state file documenting MONKEYWORX COLLECTIVE website features including industrial cyberpunk aesthetic, team dossier grid, Holi Grail 5-tier ticketing (₹449-₹78,999), corporate events page, hero video with glitch effects, and Swiggy Scenes integration."
}