{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting implemented features including VHS static overlay, logo replacement with geometric monkey icon, glitch effects, hero headline, Holi Grail poster framing, team/ticketing/corporate sections with tactical borders, and Instagram link update.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their roles in implementing the cyberpunk-themed event website with VHS effects, glitch animations, and tactical UI elements.",
  "frontend/index.css": "Tailwind CSS base configuration with CSS custom properties for light/dark themes, defining color tokens and design system variables for the application.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, page title 'MONKEYWORX COLLECTIVE', and script reference to main.tsx.",
  "frontend/src/App.tsx": "Main application component orchestrating VHS static overlay, horizontal line glitches, and all page sections (Navigation, HeroSection, HoliGrailCard, TeamSection, TicketingSection, CorporateEventsSection, Footer) with matte black background.",
  "frontend/src/components/CorporateEventsSection.tsx": "Corporate events section displaying services grid (Concerts, Weddings, Corporate Parties, Private Events) with tactical borders, corporate perks callout, and phone contact CTA with scroll-triggered fade-in animation.",
  "frontend/src/components/Footer.tsx": "Site footer with three-column layout containing brand info, quick links with smooth scroll navigation, social media icons (Facebook, Instagram @monkeyworxcollective, X), contact phone number, and Caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/GlitchButton.tsx": "Reusable button component with transparent background, neon cyan border in default state, transitioning to solid hot pink background with digital distortion effect on hover.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with placeholder video background, gradient overlays, 'THE RARE HOLI GRAIL EVENT' headline with chromatic aberration effect, and Swiggy booking CTA.",
  "frontend/src/components/HoliGrailCard.tsx": "Holi Grail event card with tactical glowing border frame, poster image with horizontal glitch overlay, event description text, Swiggy booking CTA, and scroll-triggered fade-in jitter animation.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar component with logo, desktop/mobile menus, and smooth scroll-to-section functionality. Includes scroll-based background transparency and mobile hamburger menu toggle.",
  "frontend/src/components/SwiggyBookingCTA.tsx": "Call-to-action button component that opens Swiggy Scenes booking link in a new window using the GlitchButton component.",
  "frontend/src/components/TeamSection.tsx": "Team member showcase section with four core team cards featuring portraits, roles, and IDs. Uses intersection observer for fade-in animation and includes hover effects with glitch overlays.",
  "frontend/src/components/TicketingSection.tsx": "Displays five ticket tiers (from entry-only to VIP tables) with pricing, features, and color-coded styling. Uses intersection observer for visibility-based animations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages backend actor instances based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend data operations are needed as all content is static and client-side rendered.",
  "frontend/src/index.css": "Global styles with Tailwind configuration, custom CSS variables for cyberpunk theme colors (neon green, hot pink, matte black), and keyframe animations for VHS static, glitch effects, RGB split, and flicker effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a cyberpunk/industrial design system with OKLCH color variables, custom fonts (industrial, mono, bebas), extended theme including sidebar and chart colors, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document for MONKEYWORX COLLECTIVE website tracking architectural decisions (cyberpunk aesthetic with black background, neon accents, VHS static overlay, tactical UI borders) and existing features including hero section, team dossier, 5-tier ticketing system, and Swiggy Scenes integration."
}